---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HostPerimeterComputed
source: html/ca917431-7044-0e89-39b6-8b8625485621.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HostPerimeterComputed Property

"Perimeter"

## Syntax (C#)
```csharp
public static ForgeTypeId HostPerimeterComputed { get; }
```